# 1350. Students With Invalid Departments
[問題](https://leetcode.com/problems/students-with-invalid-departments/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針
`isin()`で判定する。

In [2]:
import pandas as pd

In [3]:
data = [[1, 'Electrical Engineering'], [7, 'Computer Engineering'], [13, 'Bussiness Administration']]
departments = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[23, 'Alice', 1], [1, 'Bob', 7], [5, 'Jennifer', 13], [2, 'John', 14], [4, 'Jasmine', 77], [3, 'Steve', 74], [6, 'Luis', 1], [8, 'Jonathan', 7], [7, 'Daiana', 33], [11, 'Madelynn', 1]]
students = pd.DataFrame(data, columns=['id', 'name', 'department_id']).astype({'id':'Int64', 'name':'object', 'department_id':'Int64'})

In [4]:
departments

   id                      name
0   1    Electrical Engineering
1   7      Computer Engineering
2  13  Bussiness Administration

In [5]:
students

   id      name  department_id
0  23     Alice              1
1   1       Bob              7
2   5  Jennifer             13
3   2      John             14
4   4   Jasmine             77
5   3     Steve             74
6   6      Luis              1
7   8  Jonathan              7
8   7    Daiana             33
9  11  Madelynn              1

In [14]:
def find_students(departments: pd.DataFrame, students: pd.DataFrame) -> pd.DataFrame:
    result = students[~students["department_id"].isin(departments["id"])]
    return result[["id", "name"]]

In [15]:
find_students(departments, students)

   id     name
3   2     John
4   4  Jasmine
5   3    Steve
8   7   Daiana

## Test scripts

In [11]:
result = students[~students["department_id"].isin(departments["id"])]

In [13]:
result[["id", "name"]]

   id     name
3   2     John
4   4  Jasmine
5   3    Steve
8   7   Daiana